# replace("JS","Python")
# split("*")
# upper
# lower
# capitalize 
# title()
# find 
# in True False
# strip
# lstrip
# rstript
# join

# Список он хранит у нас просто значения
# Словарь он хранит информацию обьекта


# students = [
#     {id: 1,"fullname": "Dias", "age": 19},
#     {id: 2,"fullname": "Dias", "age": 19},
#     {id: 3,"fullname": "Dias", "age": 19},
# ]


student = {
   "name": "Dias",
   "age": 18
}
# student["grade"] = 90 добавление нового ключа и его значения
# student["age"] = 17 обновлени данных
# print(student["name"])
# student.pop("age") Удаление через метод pop
# print(student)
# print(student.get("age", "Нет данных"))
# get -> это у нас безопасный способ получение данных

# for i in student:
#     print(i)

# for i in student.values():
#     print(i)

# for key, value in student.items(): 
#     print(key, "-", value)
# items() -> сделать перебор по всему обьекту

# values() дает возможность сделать перебор именно значений

# crud -> 
# Create
# R - read/show
# u - update
# d - delete

# user = {
#    "name": "Dias",
#    "age": 18,
#    "scores": {
#        "math": 90,
#        "python": 100,
#        "dev":{
#            "frontend":{
#                "lang1": "Html",
#                "lang1": "css",
#                "JS":{
#                    "JS1": "React",
#                    "JS2": "Vue"
#                }
#            },
#            "backend":{
               
#            }

#        }
#    }
# }
# print(user["scores"]["dev"][])
# Сверху пример не испольузем 


# 1.
# students ={
#     "Dias": 100,
#     "Madina": 95,
#     "Aruzhan": 60,
    
# }

# for name, score in students.items():
#     print(name, ":", score)

# # 2.
# best = max(students, key=students.get)
# print(best, students[best])

# pairs = [
#     ("Aruzhan", 16),
#     ("Dias", 17)
# ]
# pairs.append(("Aruzhan", 16))
# d = dict(pairs)
# for key, age in d.items():
#     print(key, "-",age)


# users = {
#     1: {"name": "Dias", "role": "admin"},
#     2: {"name": "Almas", "role": "user"}
# }

# for user_id, info in users.items():
#     print(f"ID: {user_id}, Name: {info["name"]}, Role: {info["role"]}")

# for i in users:
#     print(i)

# for i in users.values():
#     print(i["name"])


# Уровень 1 — Лёгкие задачи (1–5)
# 1. Создайте словарь с именем и возрастом. Выведите возраст.

# Пример:
# {"name": "Aruzhan", "age": 17}

# 2. Дан словарь. Измените значение ключа "age" на новое число.
# 3. Добавьте в словарь новый ключ "city" со значением.
# 4. Удалите из словаря ключ "age".
# 5. Дан словарь из трёх предметов и баллов. Выведите все ключи и все значения.


# person =  {
#     "name": "Aruzhan", 
#     "age": 17
#     }
# 1.
# print(person["age"])
# print(person.get("age", "Иначе"))

# 2.
# person["age"] = 18
# print(person)

# 3.
# person["city"] = "Astana"
# print(person)

# 4.
# person.pop("age")
# print(person)

# 5.
# scores = {
#     "math":90,
#     "english": 85,
#     "python": 100
# }

# for key, value in scores.items():
#     print(f"Subject: {key} -- Grade: {value}")


# 6. Дан словарь из товаров: название → цена. Найдите самую дешёвую цену.
# **7. Создайте словарь студентов: имя → балл.

# Выведите только тех, у кого балл ≥ 80.**

# **8. Дан словарь {1: "a", 2: "b", 3: "c"}.

# Поменяйте местами ключи и значения.**

# **9. Дан словарь пользователя.

# Если ключ "premium" отсутствует — добавьте его со значением False.**

# 10. Подсчитайте количество ключей в словаре без функции len().
# **11. Дан словарь: товар → количество.

# Уменьшите количество товара на 1, если оно больше нуля.**

# **12. Дан словарь с координатами точки:

# {"x": 10, "y": 20, "z": -5}
# Увеличьте каждую координату в 2 раза.**



# products = {
#     "apple": 120,
#     "banana": 80,
#     "orange": 150,
# }
# min_product = min(products, key = products.get)
# print("Самый дешевый: ", min_product, "Цена: ", products[min_product])


# students = {
#     "Dias": 78,
#     "Eduard": 92,
#      "Maxim": 85
#      }

# for name, score in students.items():
#     if score >= 80:
#         print(name, score)

# 8. Дан словарь {1: "a", 2: "b", 3: "c"

# change = {
#     1: "a",
#     2: "b",
#     3: "c"
# }


# swapped = {
#     value: key for key, value in change.items()
#     }
# print(swapped)

# user = {
#     "name": "Dias",
#     "age": "17",
    
# }

# if "premium" not in user:
#     user["premium"] = False
# print(user)


# 10. Подсчитайте количество ключей в словаре без функции len().

# random = {
#     1: 1,
#     2: 2,
#     3: 3,
#     4: 4
# }
# count = 0
# for i in random:
#     count +=1

# print(count)


#  **11. Дан словарь: товар → количество.

# Уменьшите количество товара на 1, если оно больше нуля.**

# products = {
#     "apple": 45,
#     "banana": 9,
#     "cherry": 3 
# }

# for key, products in products.items():
#     if products > 0:
#         products -= 1
#         print(key, products)


# **12. Дан словарь с координатами точки:

# {"x": 10, "y": 20, "z": -5}
# Увеличьте каждую координату в 2 раза.**

# cor = {
#         "x": 10,
#         "y": 20,
#         "z": -5
#         }

# for key, score in cor.items():
#         score *= 2
#         print(key, score)
        


#  Уровень 3 — Сложные задачи (13–17)
# **13. Дан словарь учащихся: имя → список оценок.

# Найдите средний балл каждого ученика.**
# Пример:
# {"Dias": [90, 80], "Madina": [100, 95]}

# 14. Дан список слов. Подсчитайте частоту каждого слова с помощью словаря.

# Пример:
# ["apple", "banana", "apple"] → {"apple": 2, "banana": 1}

# 15. Дан текст. Используя словарь, посчитайте частоту каждого символа.
# **16. Дан словарь пользователей: id → данные.

# Выведите имена всех пользователей с ролью “admin”.**

# **17. Дан словарь: категория → список товаров.

# Посчитайте общее количество всех товаров во всех категориях.**
# Пример:
# {"fruits": ["apple", "banana"], "cars": ["bmw"]} → 3

# 🟪 Уровень 4 — Очень сложные задачи (18–20)

# Используют вложенные структуры, логику, обработку.

# **18. Дан список словарей (каждый словарь — ученик).

# Найдите ученика с максимальным средним баллом.**
# Пример:

# [
#   {"name": "Dias", "scores": [80, 90, 100]},
#   {"name": "Madina", "scores": [95, 90, 88]}
# ]

# **19. Дан словарь магазина: товар → {цена, количество}.

# Найти товар с максимальной стоимостью цена × количество.**

# **20. Дан словарь-задания: студент → {completed, total}.

# Для каждого студента посчитайте процент выполнения.
# Найдите того, у кого процент самый высокий.**

# Пример:

# {
#   "Dias": {"completed": 7, "total": 10},
#   "Madina": {"completed": 9, "total": 12}
# }

# students = {
#             "Dias": [90, 80,75],
#             "Madina": [100, 95,90],
#             "Albert": [100, 95,100]
             
#         }
# for name, grades in students.items():
#     avg = sum(grades) / len(grades)
#     print(name, "-", avg)

# words = ["apple", "banana", "banana", "melon","apple","apple","apple","apple","apple","apple","apple",]

# dict2 = {}

# for i in words:
#     dict2[i] = dict2.get(i, 0) + 1
# print(dict2)


# 15. Дан текст. Используя словарь, посчитайте частоту каждого символа.

# text = "hello world"

# dict3 = {}

# for i in text:
#     dict3[i] = dict3.get(i, 0) + 1

# print(dict3)

products = {
    "fruits": ["apple", "banana", "orange"],
    "cars": ["bmw", "audi"]
}

total = 0 
for i in products.values():
    total += len(i)
print(total)