# Создание массивов(списков)
# numbers = [10, 20, 30, 40, 50]
# names = ["Dias", "Aurean", "Diana", "Almat"]
# mixed = ["Dias", 3.14, 123, True]
# empty = []
# print(numbers, mixed, names, empty)

# # Индексы внутри списков
# numbers = [10, 20, 30, 40, 50]
# print(numbers[0])
# print(numbers[4])

# # Отрицательные индексы с конца
# print(numbers[-1])
# print(numbers[-2])
# print(len(numbers) - 1)

# Mutation -> мутация(изменение)
# numbers = [10,20,30,40]
# numbers[0] = 100
# numbers[1] = 200
# numbers[2] = "Qwerty"
# numbers[-1] = True
# print(numbers)

# ПЕРЕБОР МАССИВА ДЕЛАЕТСЯ ЧЕРЕЗ ЦИЛК FOR

# numbers = [10,20,30,40]
# for i in numbers:
#     print(i)

# ПЕРЕБОР МАССИВА ГДЕ МЫ ОТДЕЛЬНО ПОКАЗЫВАЕМ ИНДЕКСЫ

# numbers = [10,20,30,40]
# for i in range(len(numbers)):
#     print("Индекс:", i, "Значение", numbers[i])

# Слайсы 
# numbers = [10,20,30,40,50]

# print(numbers[1:4]) элементы с индекса 1 до 3 индекс
# print(numbers[:3]) элементы с начало до 2 индекс
# print(numbers[2:]) c индекса 2 до конца
# print(numbers[-2:]) 

# Основые операторы с массивом
# Нахождение элемента внутри массива возвращает TRUE OR FALSE
# numbers = [10,20,30,40]
# print(10 in numbers)
# print(50 in numbers)

# Ариф операторы с массивом

# a = [1,2]
# b = [2,3]
# w = ["qwerty", True]

# c = a + b + w
# print(c)
# f = "qwerty"
# d = 5
# j = f + d
# print(j)

# zero = [0] * 5
# print(zero)

# -------------ЗАДАЧИ------------
# 1. Вывести первый и последний элемент

# Дан список чисел. Выведи первый и последний элемент через пробел.
# numbers = [10,20,30,40]
# print(numbers[0], numbers[-1])

# 2. Вывести элементы по индексам

# Дан список из 5 элементов. Выведи элемент с индексом 2 и элемент с индексом -2.
# numbers = [10,20,30,40,50]
# print(numbers[2])
# print(numbers[-2])

# 3. Изменить значения в списке

# Дан список [10, 20, 30, 40].
# Замени:

# первый элемент на 100

# последний на "END"

# Выведи результат.

# numbers = [10, 20, 30, 40]
# numbers[0] = 100
# numbers[3] = "END"
# print(numbers)

# 4. Сумма элементов вручную
# Дан список чисел.
# Через цикл найди сумму всех элементов (не использовать sum()).

# numbers = [10,20,30,40,50]
# total = 0
# for i in numbers:
#     total += i
# print(total)

# 5. Найти максимальный элемент вручную

# Дан список.
# Через цикл найди самое большое число.
# numbers = [23,99,5,123,55,101,6,1,78]
# max_value = numbers[0]
# for i in numbers:
#     if i > max_value:
#         max_value = i
# print(max_value)

# 6. Подсчитать количество чётных чисел

# Через перебор посчитай, сколько в списке чётных элементов.

# numbers = [23,99,5,123,55,101,6,1,78]

# count_even = 0
# for i in numbers:
#     if i % 2 == 0:
#         count_even += 1
# print(count_even)

#  Вывести индексы и значения

# Через range(len(list)) выведи:
# Индекс: X → Значение: Y

# numbers = [23,99,5,123,55,101,6,1,78]

# for i in range(len(numbers)):
#     print("Индекс: ", i, "-> Значения:", numbers[i])

# 8. Слайс: вывести середину

# Дан список из 7 элементов.
# Выведи средние 3 элемента через слайс.
# numbers = [23,99,5,123,55,101,6]
         
# middle = numbers[2:5]
# middle = numbers[3:4]
# print(middle)

# 9. Проверить, есть ли число в списке

# Пользователь вводит число.
# Если оно находится в списке — вывести "YES", иначе "NO".

# nums = [10,20,30,40]

# num = int(input("Введите число: "))

# if num in nums:
#     print("YES")
# else:
#     print("NO")

# 10. Соединить два списка

# Даны два списка.
# Создай третий, который представляет собой их конкатенацию.

# a = [1,2,123,123334,1983190]
# b = ["qkejakl;s", True, False, "qw32asidou"]
# c = ["🥝", "🥥", "🍏"]
# concat = a + b + c

# print(concat)

# 11. Создать список из пяти нулей

# Используя умножение списков ([0] * N), создай список из 5 нулей.

# num = ["🥦"] * 10
# print(num)


# 12. Увеличить каждый элемент на 10

# Не меняя оригинальный список, создай второй, где каждый элемент увеличен на 10.

# nums = [10,20,30]

# new_massiv = []
# for i in nums:
#     new_massiv += [i + 10]
# print(new_massiv)

# 13. Найти количество элементов вручную

# С помощью цикла подсчитай длину списка (не использовать len()).

# nums = [10,20,30,40]
# count = 0 
# for i in nums:
#     count += 1
# print(count)


# 14. Развернуть список вручную

# Дан список.
# Создай новый список, куда элементы копируются с конца к началу.

# fruits = ["🥝", "🥥", "🍏","🥦"]

# fruits_copy = []

# for i in range(len(fruits)-1, -1, -1):
#     fruits_copy += [fruits[i]]

# print(fruits_copy)

# 15. Фильтр: оставить только строки

# Дан смешанный список, например:
# ["A", 123, "Qwerty", True, "X"]

# massiv = ["A", 123, "Qwerty", True, "X"]

# only_str = []

# for i in massiv:
#     if type(i) == str:
#         only_str += [i]
# print(only_str)

# append(x)
# extend
# insert
# remove
# pop
# clear
# reverse
# sort
# copy


# append -> добавить элемент в конец

# numbers = [1,5,9]

# numbers.append(23)
# print(numbers)

# extend -> обьединяет очень круто, без потерь памяти не ломает индексы

# a = [1,2,3]
# b = [4,5]
# a.extend(b)

# print(a)


# insert -> это у нас добавление элемента через индекс insert(index, значение)
# nums = [10,20,30]
# nums.insert(1, 15)
# nums.insert(0,"🍙")
# print(nums)

# remove -> удаление элемента по значение НЕ ПО ИНДЕКСУ

# nums = [10,20,30,40]
# nums.remove(50)
# print(nums)

# pop -> метод который удаляет элемени по индексу

# nums = [10,20,30,40]
# nums.pop(2)

# print(nums)


# clear -> УДАЛЯЕТ ЗНАЧЕНИЯ ВНУТРИ МАССИВА, НЕ САМ МАССИВ
# nums = [10,20,30,40]
# nums.clear()
# print(nums)

# reverse -> переворачивае ЗНАЧЕНИЯ МАССИВА, НЕ ИНДЕКСЫ 
# nums = [10,20,30,40]
# nums.reverse()
# print(nums)

# sort -> сортировка массива по условию

# nums = [5,2,3,1,4]
# nums.sort()
# print(nums)

# names = ["б", "в", "а", "г"]
# names.sort()
# print(names)

# copy -> копирует массив либо какой то элемент

# original = [1,2,3]
# copy_massiv = original.copy()
# copy_massiv.append(4)
# print(copy_massiv)

# sum -> сумма
# max, min
